app/Models/FavoriteModel.php

SELECT *
FROM `tbl_favorites`
WHERE `username` = 'ianfajar10'
---
    public function get($params = null)
    {
        $query = $this->where('username', $params)->find();

INSERT INTO `tbl_favorites` (`product_id`, `username`) VALUES ('22', 'ianfajar10')
---
    public function store($data)
    {
        $query = $this->db->table($this->table)->insert($data);

SELECT *
FROM `tbl_favorites`
WHERE `username` = 'ianfajar10'
AND `product_id` = '22'
---
    public function check($data)
    {
        $query = $this->db->table($this->table)
            ->where('username', $data['username'])
            ->where('product_id', $data['product_id'])
            ->get();