app/Models/ProductcategoryModel.php

SELECT *
FROM `tbl_categories`
---
    public function get($params = null)
    {
        if ($params == null) {
            return $this->findAll();