app/Models/ProductModel.php

SELECT `tbl_products`.*, `tbl_users`.`name` as `mitra_name`
FROM `tbl_products`
LEFT JOIN `tbl_users` ON `tbl_users`.`username` = `tbl_products`.`created_by`
SELECT `tbl_products`.*, `tbl_users`.`name` as `mitra_name`, (CASE WHEN tbl_favorites.product_id IS NOT NULL THEN TRUE ELSE FALSE END) as love
FROM `tbl_products`
LEFT JOIN `tbl_favorites` ON `tbl_favorites`.`product_id` = `tbl_products`.`id` AND `tbl_favorites`.`username` = 'ianfajar10'
LEFT JOIN `tbl_users` ON `tbl_users`.`username` = `tbl_products`.`created_by`
---
    public function get($params = null)
    {
        $builder = $this->builder();

        if ($params === null) {
            $builder->select('tbl_products.*, tbl_users.name as mitra_name')
                ->join('tbl_users', 'tbl_users.username = tbl_products.created_by', 'left');


            return $builder->get()->getResult();
        } else {

            $builder->select('tbl_products.*, tbl_users.name as mitra_name')
            ->join('tbl_users', 'tbl_users.username = tbl_products.created_by', 'left')
            ->where('tbl_products.id', $params)
            ->orWhere("LOWER(tbl_products.name) LIKE", "%" . strtolower($params) . "%");

            return $builder->get()->getResult();

INSERT INTO `tbl_products` (`name`, `category`, `price`, `description`, `file`, `type`, `created_by`) VALUES ('Bellfoods kentang goreng', '15', '45000', 'Kentang goreng siap digoreng dengan rasa original', 'kentang.jpeg', 'image/jpeg', 'toko99')
---
    public function save_product($data)
    {
        $query = $this->db->table($this->table)->insert($data);