app/Models/ProductModel.php

SELECT `tbl_products`.*, `tbl_favorites`.`product_id`, `tbl_favorites`.`username`
FROM `tbl_products`
LEFT JOIN `tbl_favorites` ON `tbl_favorites`.`product_id` = `tbl_products`.`id` AND `tbl_favorites`.`username` = 'ianfajar10'
WHERE `tbl_favorites`.`username` = 'ianfajar10'
---
    public function get($params = null, $params2 = null)
    {
        $builder = $this->builder();

        if ($params2 === null) {
            if ($params === null) {
                $builder->select('tbl_products.*, tbl_users.name as mitra_name');

                if (isset($this->session) && $this->session->get('username') != null) {
                    $builder->select('(CASE WHEN tbl_favorites.product_id IS NOT NULL THEN TRUE ELSE FALSE END) as love')
                        ->join('tbl_favorites', 'tbl_favorites.product_id = tbl_products.id AND tbl_favorites.username = ' . $this->db->escape($this->session->get('username')), 'left');
                }

                $builder->join('tbl_users', 'tbl_users.username = tbl_products.created_by', 'left');

                return $builder->get()->getResult();
            } else {
                $builder->select('tbl_products.*, tbl_users.name as mitra_name, tbl_categories.name as category_name');

                if (isset($this->session) && $this->session->get('username') != null) {
                    $builder->select('(CASE WHEN tbl_favorites.product_id IS NOT NULL THEN TRUE ELSE FALSE END) as love')
                        ->join('tbl_favorites', 'tbl_favorites.product_id = tbl_products.id AND tbl_favorites.username = ' . $this->db->escape($this->session->get('username')), 'left');
                }

                $builder->join('tbl_users', 'tbl_users.username = tbl_products.created_by', 'left')
                    ->join('tbl_categories', 'tbl_products.category = tbl_categories.id', 'left')
                    ->where('tbl_products.id', $params)
                    ->orWhere("LOWER(tbl_products.name) LIKE", "%" . strtolower($params) . "%");

                return $builder->get()->getResult();