app/Models/TransactionModel.php

SELECT *
FROM `tbl_transaction`
---
    public function get($params = null)
    {
        $query = $this->find();