app/Models/TransactionModel.php

    public function get_report($params = null)
    {
        $builder = $this->builder();

        $builder = $this->db->table('tbl_users u');
        $builder->select('u.name as name, u.provinsi, u.email, u.telepon, SUM(t.qty) as total_products_sold');
        $builder->join('tbl_products p', 'u.username = p.created_by');
        $builder->join('tbl_transaction t', 'p.id = t.product_id');
        $builder->groupBy('u.name, u.provinsi, u.email, u.telepon');
        $builder->orderBy('total_products_sold', 'DESC');
        $query = $builder->get();
---
SELECT `u`.`name` as `name`, `u`.`provinsi`, `u`.`email`, `u`.`telepon`, SUM(t.qty) as total_products_sold
FROM `tbl_users` `u`
JOIN `tbl_products` `p` ON `u`.`username` = `p`.`created_by`
JOIN `tbl_transaction` `t` ON `p`.`id` = `t`.`product_id`
GROUP BY `u`.`name`, `u`.`provinsi`, `u`.`email`, `u`.`telepon`
ORDER BY `total_products_sold` DESC