app/Models/UserModel.php

    public function update_profile($username, $data)
    {
        return $this->db->table($this->table)
            ->where('username', $username)
            ->update($data);
---
SELECT *
FROM `tbl_users`
WHERE `username` = 'admin'
UPDATE `tbl_users` SET `email` = 'ian.fajar10@gmail.com', `telepon` = '0895348241531', `name` = 'Alfian Fajar Ramadhans'
WHERE `username` = 'ianfajar10'

    public function check_login($data)
    {
        $query = $this->where('username', $data['username'])->find();
---
SELECT *
FROM `tbl_users`
WHERE `username` = 'toko99'